nhan123iddkw23/STM/STM32F103C8T6_HAL/PROJECT_SD_CARD/SD_CARD1/main.c
#include "stm32f10x.h"
#include "delay.h"
#include "ff.h"
#include "spi.h"
#include "ffconf.h"


FATFS FatFs;		/* FatFs work area needed for each volume */
FIL Fil;			/* File object needed for each open file */

void My_GPIO_Init(void);
uint8_t dem = 0;


int main() {
	UINT bw;
	FRESULT fr;
	My_GPIO_Init();
	My_SPI_Init();
	Delay_Init();
	

	f_mount(&FatFs, "", 0);		/* Give a work area to the default drive */

	fr = f_open(&Fil, "abc.txt", FA_WRITE | FA_CREATE_ALWAYS);	/* Create a file */
	dem = 3;
	if (fr == FR_OK) {
		dem = 2;
		f_write(&Fil, "Hello World", 11, &bw);	/* Write data to the file */
		fr = f_close(&Fil);	
		
		/* Close the file */
		if (fr == FR_OK && bw == 11) {		/* Lights green LED if data written well */
			while (1) {
				GPIO_SetBits(GPIOC, GPIO_Pin_13);
				Delay_Ms(1000);
				GPIO_ResetBits(GPIOC, GPIO_Pin_13);
				Delay_Ms(1000);
				dem =1;
			}
		}
	}
	
	while(1) {
		GPIO_SetBits(GPIOC, GPIO_Pin_13);
		Delay_Ms(500);
		GPIO_ResetBits(GPIOC, GPIO_Pin_13);
		Delay_Ms(500);
	}

//   GPIO_SetBits(GPIOC, GPIO_Pin_13);
//		Delay_Ms(100);
//		
//		GPIO_ResetBits(GPIOA, GPIO_Pin_4);
//		My_SPI_Exchange(0x19);
//		GPIO_SetBits(GPIOA, GPIO_Pin_4);
//		
//		GPIO_ResetBits(GPIOC, GPIO_Pin_13);
//		Delay_Ms(100);
//		
//		GPIO_ResetBits(GPIOA, GPIO_Pin_4);
//		My_SPI_Exchange(0x86);
//		GPIO_SetBits(GPIOA, GPIO_Pin_4);
}


void My_GPIO_Init(void) {
	GPIO_InitTypeDef gpioInit;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	gpioInit.GPIO_Mode=GPIO_Mode_Out_PP;
	gpioInit.GPIO_Speed=GPIO_Speed_50MHz;
	gpioInit.GPIO_Pin=GPIO_Pin_13;
	GPIO_Init(GPIOC, &gpioInit);
}
